#include <stdio.h>

/*
2.	Да се напише програма, която чете час и минути от 24-часово денонощие, въведени от потребителя, и изчислява колко ще е часът след 15 минути. Резултатът да 
се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри. Минутите се изписват 
винаги с по две цифри, с водеща нула когато е необходимо. 

Примери:

вход	изход								
1
46      2:01	

вход	изход
0
01	    0:16	

вход	изход
23
59	    0:14	

вход	изход
11
08	    11:23	

вход	изход	
12
49	    13:04
*/

int main() 
{
    int hours, minutes;
    printf("Enter hours and minutes (hh mm): ");
    scanf("%d %d", &hours, &minutes);

    minutes += 15;

    while (minutes >= 60) 
    {
        minutes -= 60;
        hours += 1;
    }

    while (hours >= 24) 
    {
        hours -= 24;
    }

    printf("%d:%02d\n", hours, minutes);

    return 0;
}