#include <stdio.h>
#include <stdlib.h>

/*
9з. Даден е двумерен масив А[4][5]. Да се изчислят сумите от елементите по редове и да
се намери минималната сума сред тях. Резултатът да се изведе във вида:

а_11 a_12 a_13 a_14 a_15 | sum_1
а_21 a_22 a_23 a_24 a_25 | sum_2
а_31 a_32 a_33 a_34 a_35 | sum_3
а_41 a_42 a_43 a_44 a_45 | sum_4

Минимална сума: sum_min
*/

int main ()
{  
    int arr[4][5];
    printf("Elem: ");
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            scanf("%i", arr[i][j]);
        }
    }


    return 0;
}