#include <stdio.h>

/*
4.	Дадено е цяло число – брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу. Да се напише програма, която пресмята бонус 
точките за това число и общия брой точки с бонусите.
●	Ако числото е до 100 включително, бонус точките са 5.
●	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
●	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
●	Допълнителни бонус точки (начисляват се отделно от предходните):
o	За четно число 🡪 + 1 т.
o	За число, което завършва на 5 🡪 + 2 т.

Примери:
вход	изход						
20	    6
        26		

вход	изход   
175	    37
        212		

вход	Изход
2703	270.3
        2973.3	

вход	изход
15875	1589.5
        17464.5
*/

int main() {
    int points;
    printf("Enter the number of points: ");
    scanf("%d", &points);

    double bonus = 0;

    if (points <= 100) 
    {
        bonus = 5;
    } 
    else if (points > 100 && points <= 1000) 
    {
        bonus = points * 0.20;
    } 
    else if (points > 1000) 
    {
        bonus = points * 0.10;
    }

    if (points % 2 == 0) 
    {
        bonus += 1;
    }
    if (points % 10 == 5) 
    {
        bonus += 2;
    }

    double totalPoints = points + bonus;

    printf("Bonus points: %.1f\n", bonus);
    printf("Total points with bonus: %.1f\n", totalPoints);

    return 0;
}