Многомерни масиви в C

Масив от масиви. Един елемент от едномерен масив съдържа в себе си още един масив.

Основен запис:
<тип> име [измерение 1][измерение 2]...[измерение N];
            [ред]       [колона]

Пример:
int matrix[][3] = {{1, 3, 4}, {-1, 5, 24}};

int a[3][4] = {  
   {0, 1, 2, 3} ,   /*  задаване на ред с индекс 0 */
   {4, 5, 6, 7} ,   /*  задаване на ред с индекс 1 */
   {8, 9, 10, 11}   /*  задаване на ред с индекс 2 */
};

// или 

int a[3][4] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11};

Примерно обхождане:
int i, j;
for (i = 0; i < 3; i++)
{
    for(j = 0; j < 4; j++)
    {
        printf("%d", a[i][j]);
    }
}

Примерен вход:

int a[2][2], b[2][2], result[2][2];

for(int i = 0; i < 2; i++) 
{
    for (int j = 0; j < 2, j++) 
    {
        printf("Enter matrix 'a':");
        scanf("%d ", a[2][2]);
    }
}

for(int i = 0; i < 2; i++) 
{
    for (int j = 0; j < 2, j++) 
    {
        printf("Enter matrix 'a':");
        scanf("%d ", b[2][2]);
    }
}

for(int i = 0; i < 2; i++) 
{
    for (int j = 0; j < 2, j++) 
    {
        result[2][2] = a[2][2] + b[2][2]
    }
}

for(int i = 0; i < 2; i++) 
{
    for (int j = 0; j < 2, j++) 
    {
        printf("%d", result[2][2]);
    }
}

Главен диагонал:
int a [i][i];

Второстепеннен диагонал:
int a [i][n - 1 - i]    //където n е размера на масива